Documents/ВозвратТМЦПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВозвратТМЦПокупателя</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
				<xr:Item>AccumulationRegister.СальдоПоТаре</xr:Item>
				<xr:Item>AccumulationRegister.Сальдо</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Полный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладНакопления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПродано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНаценкой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНаценкой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дисконт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОтпускная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОтпускная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБазовая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНаценкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОтпускная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СальдоПоТаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>СальдоПоТаре</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Сальдо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Сальдо</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВзаиморасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаиморасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоСписании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИсторияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗаказов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказАгента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВозвратТМЦПокупателя/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТМЦ") Тогда
		Основание = ДанныеЗаполнения.Ссылка;
		Автор = ПараметрыСеанса.Пользователь;
		Агент = ДанныеЗаполнения.Агент;
		ВидРеализации = ДанныеЗаполнения.ВидРеализации;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Проект = ДанныеЗаполнения.Проект;
		Склад = ДанныеЗаполнения.Склад;
		СкладНакопления = ДанныеЗаполнения.СкладНакопления;
		Филиал = ДанныеЗаполнения.Филиал;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Товар = ТекСтрокаТовары.Товар;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
			
			НоваяСтрока.КоличествоПродано = ТекСтрокаТовары.Количество;
			НоваяСтрока.Наценка = ТекСтрокаТовары.Наценка;
			НоваяСтрока.Скидка = ТекСтрокаТовары.Скидка;
			
			НоваяСтрока.ЦенаБазовая = ТекСтрокаТовары.ЦенаБазовая;
			НоваяСтрока.ЦенаОтпускная = ТекСтрокаТовары.ЦенаОтпускная;
			НоваяСтрока.ЦенаПродажная = ТекСтрокаТовары.ЦенаПродажная;
			НоваяСтрока.ЦенаСНаценкой = ТекСтрокаТовары.ЦенаСНаценкой;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подготовка регистров накопления
	Движения.Продажи.Записывать = Истина;
	Движения.Остатки.Записывать = Истина;
	Движения.СальдоПоТаре.Записывать = Истина;
	Движения.Сальдо.Записывать = Истина;
	Движения.Доходы.Записывать = Истина;
	
	Если Полный Тогда
		// Обработка товаров
		Для Каждого Строка Из Основание.Товары Цикл
			Если Строка.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.Товар) = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			// Расход товаров с остатков
			Если Склад.НеВестиУчет = Ложь Тогда
				Движение = Движения.Остатки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Товар = Строка.Товар;
				Движение.Порожняя = (Строка.Товар.ВидТовара.ТипТовара <> Перечисления.ТипыТовара.Товар);
				Движение.Примечание = глНайтиПримечания(Комментарий);
				Движение.Количество = -Строка.Количество;
				Движение.Сумма = -Строка.СуммаБазовая;
				
				Если Склад.Временный = Ложь Тогда
					Если ЗначениеЗаполнено(Строка.Товар.Тара) Тогда
						// Расход тары с остатков
						Движение = Движения.Остатки.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.Склад = Склад;
						Движение.Товар = Строка.Товар.Тара;
						Движение.Примечание = глНайтиПримечания(Комментарий);
						Движение.Количество = -Строка.Количество;
						Движение.Сумма = 0;
						Движение.Порожняя = Ложь;
						
						// Расход сальдо по таре
						Движение = Движения.СальдоПоТаре.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.Товар = Строка.Товар.Тара;
						Движение.Контрагент = Контрагент;
						Движение.Количество = -Строка.Количество;
						Движение.Сумма = 0;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Приход товара на временный склад
			Если ВидРеализации.Накапливаемый Тогда
			 	Движение = Движения.Остатки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Склад = СкладНакопления;
				Движение.Товар = Строка.Товар;
				Движение.Порожняя = (Строка.Товар.ВидТовара.ТипТовара <> Перечисления.ТипыТовара.Товар);
				Движение.Примечание = глНайтиПримечания(Комментарий);
				Движение.Количество = -Строка.Количество;
				Движение.Сумма = -Строка.СуммаБазовая;
			КонецЕсли;
			
			// Учет продажи
			Если ВидРеализации.УчетПродаж Тогда
				Движение = Движения.Продажи.Добавить();
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.ВидРеализации = ВидРеализации;
				Движение.Контрагент = Контрагент;
				Движение.Агент = Агент;
				Движение.Товар = Строка.Товар;
				Движение.Примечание = глНайтиПримечания(Комментарий);
				Движение.Количество = -Строка.Количество;
				Движение.Объем = -Строка.Объем;
				Движение.СуммаБазовая = -Строка.СуммаБазовая;
				Движение.СуммаСНаценкой = -Строка.СуммаСНаценкой;
				Движение.СуммаПродажная = -Строка.СуммаПродажная;
				Движение.СуммаОтпускная = -Строка.СуммаОтпускная;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Основание.Сумма) Тогда
			// Взаиморасчеты
			Движение = Движения.Сальдо.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.ТипВзаиморасчета = ВидРеализации.ТипВзаиморасчета;
			Движение.ПоСписании = Склад.Временный;
			Движение.Примечание = глНайтиПримечания(Комментарий);
			Движение.Сумма = -Основание.Сумма;
			
			// Доходы
			Если ВидРеализации.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Нал ИЛИ (ВидРеализации.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Безнал И Склад.Временный) Тогда
				Движение = Движения.Доходы.Добавить();
				
				Если Склад.Временный Тогда
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Иначе
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				КонецЕсли;
				
				Движение.Период = Дата;
				Движение.Статья = Справочники.СтатьиДоходовИРасходов.РозничнаяТорговля;
				Движение.Реализация = Истина;
				Движение.Примечание = глНайтиПримечания(Комментарий);
				Движение.Сумма = -Основание.Сумма;
			КонецЕсли;
		КонецЕсли;
		
		Если ВидРеализации.Заказываемый И ЗначениеЗаполнено(Основание) И ЗначениеЗаполнено(Основание.Заказ) Тогда
			Запись = Движения.ИсторияЗаказов.Добавить();
			Запись.Период = Дата;
			Запись.Заказ = Основание.Заказ;
			Запись.Статус = Перечисления.СтатусыЗаказа.ПолныйВозврат;
		КонецЕсли;
	Иначе
		// Обработка товаров
		Для Каждого Строка Из Товары Цикл
			Если Строка.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.Товар) = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			// Расход товаров с остатков
			Если Склад.НеВестиУчет = Ложь Тогда
				Движение = Движения.Остатки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Товар = Строка.Товар;
				Движение.Порожняя = (Строка.Товар.ВидТовара.ТипТовара <> Перечисления.ТипыТовара.Товар);
				Движение.Примечание = глНайтиПримечания(Комментарий);
				Движение.Количество = -Строка.Количество;
				Движение.Сумма = -Строка.СуммаБазовая;
				
				Если Склад.Временный = Ложь Тогда
					Если ЗначениеЗаполнено(Строка.Товар.Тара) Тогда
						// Расход тары с остатков
						Движение = Движения.Остатки.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.Склад = Склад;
						Движение.Товар = Строка.Товар.Тара;
						Движение.Примечание = глНайтиПримечания(Комментарий);
						Движение.Количество = -Строка.Количество;
						Движение.Сумма = 0;
						Движение.Порожняя = Ложь;
						
						// Расход сальдо по таре
						Движение = Движения.СальдоПоТаре.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.Товар = Строка.Товар.Тара;
						Движение.Контрагент = Контрагент;
						Движение.Количество = -Строка.Количество;
						Движение.Сумма = 0;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Приход товара на временный склад
			Если ВидРеализации.Накапливаемый Тогда
			 	Движение = Движения.Остатки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Склад = СкладНакопления;
				Движение.Товар = Строка.Товар;
				Движение.Порожняя = (Строка.Товар.ВидТовара.ТипТовара <> Перечисления.ТипыТовара.Товар);
				Движение.Примечание = глНайтиПримечания(Комментарий);
				Движение.Количество = -Строка.Количество;
				Движение.Сумма = -Строка.СуммаБазовая;
			КонецЕсли;
			
			// Учет продажи
			Если ВидРеализации.УчетПродаж Тогда
				Движение = Движения.Продажи.Добавить();
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.ВидРеализации = ВидРеализации;
				Движение.Контрагент = Контрагент;
				Движение.Агент = Агент;
				Движение.Товар = Строка.Товар;
				Движение.Примечание = глНайтиПримечания(Комментарий);
				Движение.Количество = -Строка.Количество;
				Движение.Объем = -Строка.Объем;
				Движение.СуммаБазовая = -Строка.СуммаБазовая;
				Движение.СуммаСНаценкой = -Строка.СуммаСНаценкой;
				Движение.СуммаПродажная = -Строка.СуммаПродажная;
				Движение.СуммаОтпускная = -Строка.СуммаОтпускная;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Сумма) Тогда
			// Взаиморасчеты
			Движение = Движения.Сальдо.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.ТипВзаиморасчета = ВидРеализации.ТипВзаиморасчета;
			Движение.ПоСписании = Склад.Временный;
			Движение.Примечание = глНайтиПримечания(Комментарий);
			Движение.Сумма = -Сумма;
			
			// Доходы
			Если ВидРеализации.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Нал ИЛИ (ВидРеализации.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Безнал И Склад.Временный) Тогда
				Движение = Движения.Доходы.Добавить();
				
				Если Склад.Временный Тогда
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Иначе
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				КонецЕсли;
				
				Движение.Период = Дата;
				Движение.Статья = Справочники.СтатьиДоходовИРасходов.РозничнаяТорговля;
				Движение.Реализация = Истина;
				Движение.Примечание = глНайтиПримечания(Комментарий);
				Движение.Сумма = -Сумма;
			КонецЕсли;
		КонецЕсли;
		
		Если ВидРеализации.Заказываемый И ЗначениеЗаполнено(Основание) И ЗначениеЗаполнено(Основание.Заказ) Тогда
			Запись = Движения.ИсторияЗаказов.Добавить();
			Запись.Период = Дата;
			Запись.Заказ = Основание.Заказ;
			Запись.Статус = Перечисления.СтатусыЗаказа.ЧастичныйВозврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если глСсылкаСуществует(Основание) = Ложь Тогда
		Основание = Неопределено;
	КонецЕсли;
	
	Если СкладНакопления.Пустая() Тогда
		СкладНакопления = Склад.Накопитель;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого Строка Из Товары Цикл
			Если Строка.ЦенаОтпускная = 0 Тогда
				Строка.ЦенаОтпускная = Строка.ЦенаПродажная;
			КонецЕсли;
			
			Если Строка.СуммаОтпускная = 0 Тогда
				Строка.СуммаОтпускная = Строка.СуммаПродажная;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Полный Тогда
		Сумма = Основание.Сумма;
	Иначе
		Сумма = Товары.Итог("СуммаОтпускная");
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ДокументПоОсновнии = Документы.ВозвратТМЦПокупателя.НайтиПоРеквизиту("Основание", Основание);
	Если ЗначениеЗаполнено(ДокументПоОсновнии) И ДокументПоОсновнии.Ссылка <> Ссылка Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Имеется возврат по выбранной реализации.";
		Сообщение.Поле = "Основание";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;;
	КонецЕсли;
КонецПроцедуры
